Revit 2024 API
MechanicalEquipmentSet Class
 A set of interrelated mechanical equipment in a MEP system that works together.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class MechanicalEquipmentSet : Element
Visual Basic
Public Class MechanicalEquipmentSet _
	Inherits Element
Visual C++
public ref class MechanicalEquipmentSet : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet
See Also
MechanicalEquipmentSet Members
Autodesk.Revit.DB.Mechanical Namespace